apache/nuttx/arch/arm/src/tlsr82/tlsr82_flash_mtd.c
/****************************************************************************
 * arch/arm/src/tlsr82/tlsr82_flash_mtd.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/param.h>
#include <sys/types.h>

#include <nuttx/irq.h>
#include <nuttx/mm/mm.h>
#include <nuttx/kmalloc.h>

#include "hardware/tlsr82_gpio.h"
#include "tlsr82_flash.h"
#include "tlsr82_flash_mtd.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Flash size deifnitions */

#define TLSR82_SECTOR_SHIFT           12
#define TLSR82_SECTOR_SIZE            (1 << TLSR82_SECTOR_SHIFT)
#define TLSR82_PAGE_SHIFT             8
#define TLSR82_PAGE_SIZE              (1 << TLSR82_PAGE_SHIFT)

/* Flash layout definitions */

#define TLSR82_START_ADDR             (0)
#define TLSR82_TOTAL_SIZE             (512 * 1024)

#define TLSR82_BANKA_ADDR             TLSR82_START_ADDR
#define TLSR82_BANKA_SIZE             (240 * 1024)

#define TLSR82_USR_ADDR               (TLSR82_BANKA_ADDR + TLSR82_BANKA_SIZE)
#define TLSR82_USR_SIZE               (12 * 1024)

#define TLSR82_KEY_ADDR               (TLSR82_USR_ADDR + TLSR82_USR_SIZE)
#define TLSR82_KEY_SIZE               (4 * 1024)

#define TLSR82_BANKB_ADDR             (TLSR82_KEY_ADDR + TLSR82_KEY_SIZE)
#define TLSR82_BANKB_SIZE             (240 * 1024)

#define TLSR82_SYS_ADDR               (TLSR82_BANKB_ADDR + TLSR82_BANKB_SIZE)
#define TLSR82_SYS_SIZE               (16 * 1024)

/* Flash write buffer size definitions */

#ifdef CONFIG_TLSR82_FLASH_WRITE_BUFFER
#  define FLASH_WRITE_BUF_SIZE        CONFIG_TLSR82_FLASH_WRITE_BUFFER_SIZE
#endif

/* Flash test definitions */

#ifdef CONFIG_TLSR82_FLASH_TEST

/* Flash sector erase trace macro definition */

#define FLASH_ERASE_TRACE_START()
#define FLASH_ERASE_TRACE_END()

/* Flash page read/write trace macro definition */

#define FLASH_READ_TRACE_START()
#define FLASH_READ_TRACE_END()

#define FLASH_WRITE_TRACE_START()
#define FLASH_WRITE_TRACE_END()

/* Flash protect/unprotect trace marco definition */

#define FLASH_PROT_TRACE_START()
#define FLASH_PROT_TRACE_END()

#define FLASH_UNPROT_TRACE_START()
#define FLASH_UNPROT_TRACE_END()

#define FLASH_BUF_LIST16(n) \
  n    , n + 1, n +  2, n +  3, n +  4, n +  5, n +  6, n +  7, \
  n + 8, n + 9, n + 10, n + 11, n + 12, n + 13, n + 14, n + 15,

#define FLASH_BUF_LIST128(n) \
  FLASH_BUF_LIST16(n) \
  FLASH_BUF_LIST16(n + 0x10) \
  FLASH_BUF_LIST16(n + 0x20) \
  FLASH_BUF_LIST16(n + 0x30) \
  FLASH_BUF_LIST16(n + 0x40) \
  FLASH_BUF_LIST16(n + 0x50) \
  FLASH_BUF_LIST16(n + 0x60) \
  FLASH_BUF_LIST16(n + 0x70) \

#endif
/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This type represents the state of the MTD device.
 * The struct mtd_dev_s must appear at the beginning of the definition
 * so that you can freely cast between pointers to struct mtd_dev_s and
 * struct tlsr82_flash_dev_s.
 */

struct tlsr82_flash_dev_s
{
  struct mtd_dev_s      mtd;          /* MTD interface */
  uint32_t              baseaddr;     /* mtd flash start address */
  uint32_t              size;         /* available size for MTD */
  uint16_t              nsectors;     /* Number of erase sectors */
  uint16_t              sectorsize;   /* Size of one sector */
  uint16_t              pagesize;     /* Size of one page */
};

struct tlsr82_partition_s
{
  char *path;
  off_t firstblock;
  off_t nblocks;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Flash mtd partition table */

#ifdef CONFIG_MTD_PARTITION
static const struct tlsr82_partition_s tlsr82_part_table[] =
{
  {
    .path       = "dev/banka",
    .firstblock = TLSR82_BANKA_ADDR / TLSR82_PAGE_SIZE,
    .nblocks    = TLSR82_BANKA_SIZE / TLSR82_PAGE_SIZE,
  },
  {
    .path       = "dev/usr",
    .firstblock = TLSR82_USR_ADDR / TLSR82_PAGE_SIZE,
    .nblocks    = TLSR82_USR_SIZE / TLSR82_PAGE_SIZE,
  },
  {
    .path       = "dev/key",
    .firstblock = TLSR82_KEY_ADDR / TLSR82_PAGE_SIZE,
    .nblocks    = TLSR82_KEY_SIZE / TLSR82_PAGE_SIZE,
  },
  {
    .path       = "dev/bankb",
    .firstblock = TLSR82_BANKB_ADDR / TLSR82_PAGE_SIZE,
    .nblocks    = TLSR82_BANKB_SIZE / TLSR82_PAGE_SIZE,
  },
  {
    .path       = "dev/sys",
    .firstblock = TLSR82_SYS_ADDR / TLSR82_PAGE_SIZE,
    .nblocks    = TLSR82_SYS_SIZE / TLSR82_PAGE_SIZE,
  }
};
#endif

/* Flash manufacture ID and unique ID */

static uint32_t g_flash_mid;
static uint8_t g_flash_uid[16];

/* Flash byte write buffer when enable the flash byte write buffer */

#ifdef CONFIG_TLSR82_FLASH_WRITE_BUFFER
static uint8_t flash_write_buffer[FLASH_WRITE_BUF_SIZE];
#endif

/* Flash test buffer when enable the flash test */

#ifdef CONFIG_TLSR82_FLASH_TEST

static uint8_t flash_buffer[TLSR82_PAGE_SIZE] =
{
  FLASH_BUF_LIST128(0)
  FLASH_BUF_LIST128(1)
};

static uint8_t flash_read_buffer[TLSR82_PAGE_SIZE];
static char print_buf[128];
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

