apache/nuttx/arch/arm/src/tlsr82/tlsr82_flash_mtd.c
/* Flash driver methods */

static int tlsr82_flash_chip_erase(struct tlsr82_flash_dev_s *priv);

#ifdef CONFIG_TLSR82_FLASH_TEST
static void tlsr82_flash_print(const char *msg, const uint8_t *buf,
                               size_t len);

static int tlsr82_flash_test(struct tlsr82_flash_dev_s *priv);
#endif

/* MTD driver methods */

static int     tlsr82_flash_erase (struct mtd_dev_s *dev, off_t startblock,
                                   size_t nblocks);

static ssize_t tlsr82_flash_bread (struct mtd_dev_s *dev, off_t startblock,
                                   size_t nblocks, uint8_t *buf);

static ssize_t tlsr82_flash_bwrite(struct mtd_dev_s *dev, off_t startblock,
                                   size_t nblocks, const uint8_t *buf);

static ssize_t tlsr82_flash_read  (struct mtd_dev_s *dev, off_t offset,
                                   size_t nbytes, uint8_t *buffer);

#ifdef CONFIG_MTD_BYTE_WRITE
static ssize_t tlsr82_flash_write (struct mtd_dev_s *dev, off_t offset,
                                   size_t nbytes, const uint8_t *buffer);
#endif

static int     tlsr82_flash_ioctl (struct mtd_dev_s *dev, int cmd,
                                   unsigned long arg);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tlsr82_flash_readid
 ****************************************************************************/

static int tlsr82_flash_chip_erase(struct tlsr82_flash_dev_s *priv)
{
  int i;
  uint32_t addr;

  addr = priv->baseaddr;
  for (i = 0; i < priv->nsectors; i++)
    {
      finfo("Erase sector: %d, address: 0x%08lx\n", i, addr);
      tlsr82_flash_erase_sector(addr);
      addr += priv->sectorsize;
    }

  return OK;
}

/****************************************************************************
 * Name: tlsr82_flash_print
 ****************************************************************************/

#ifdef CONFIG_TLSR82_FLASH_TEST
static void tlsr82_flash_print(const char *msg, const uint8_t *buf,
                               size_t len)
{
  int i = 0;
  int off = 0;

  ferr("%s\n", msg);
  while (len--)
    {
      if (i % 16 == 0)
        {
          snprintf(&print_buf[off],
                   sizeof(print_buf) - off, "0x%08x:", i);
          off += strlen(&print_buf[off]);
        }

      snprintf(&print_buf[off],
               sizeof(print_buf) - off, "0x%02x ", buf[i]);
      off += strlen(&print_buf[off]);

      if (++i % 16 == 0)
        {
          ferr("%s\n", print_buf);
          off = 0;
        }
    }

  if (i % 16 != 0)
    {
      ferr("%s\n", print_buf);
    }
}
#endif

/****************************************************************************
 * Name: tlsr82_flash_test
 ****************************************************************************/

#ifdef CONFIG_TLSR82_FLASH_TEST
static int tlsr82_flash_test(struct tlsr82_flash_dev_s *priv)
{
  struct mtd_geometry_s geo;
  int ret      = 0;
  int npages   = 0;
  int i        = 0;
  int j        = 0;

  ferr("======== Flash test start ========\n");

  /* 1. print the manufacture id and unique id */

  ferr("Flash information print:\n");
  ferr("    Flash MID: 0x%08lx\n", g_flash_mid);
  snprintf(&print_buf[ret],
           sizeof(print_buf) - ret, "    Flash UID: ");
  ret += strlen(&print_buf[ret]);
  for (i = 1; i < 16; i++)
    {
      snprintf(&print_buf[ret],
               sizeof(print_buf) - ret, "0x%x ", g_flash_uid[i]);
      ret += strlen(&print_buf[ret]);
    }

  ferr("%s\n", print_buf);

  ret = tlsr82_flash_ioctl(&priv->mtd, MTDIOC_GEOMETRY, (unsigned long)&geo);
  if (ret != OK)
    {
      ferr("    Flash geometry get failed, ret=%d\n", ret);
      goto errout;
    }

  npages = priv->nsectors * (TLSR82_SECTOR_SIZE / TLSR82_PAGE_SIZE);

  ferr("    Flash Start Address: 0x%08lx\n", priv->baseaddr);
  ferr("    Flash Size         : 0x%08lx\n", priv->size);
  ferr("    Flash Sector Size  : %ld\n", geo.erasesize);
  ferr("    Flash Page Size    : %ld\n", geo.blocksize);
  ferr("    Flash Sector       : %ld\n", geo.neraseblocks);
  ferr("    Flash Page         : %d\n", npages);

  /* 2. erase chip and check all the erased sector, all the bit in erased
   *    sector should be 1.
   */

  ferr("Flash chip erase test start:\n");

  FLASH_ERASE_TRACE_START();
  ret = tlsr82_flash_ioctl(&priv->mtd, MTDIOC_BULKERASE, 0);
  if (ret != OK)
    {
      ferr("    Flash erase failed, ret=%d\n", ret);
      goto errout;
    }

  FLASH_ERASE_TRACE_END();

  for (i = 0; i < npages; i++)
    {
      FLASH_READ_TRACE_START();
      ret = tlsr82_flash_bread(&priv->mtd, i, 1, flash_read_buffer);
      FLASH_READ_TRACE_END();
      if (ret != 1)
        {
          ferr("    Flash block read failed, ret=%d\n", ret);
          goto errout;
        }

      for (j = 0; j < TLSR82_PAGE_SIZE; j++)
        {
          if (flash_read_buffer[j] != 0xff)
            {
              ferr("    Flash erased data is not 0xff, page_i=%d, byte_j=%d,"
                   "data=0x%x\n", i, j, flash_read_buffer[j]);
              goto errout;
            }
        }
    }

  ferr("Flach chip erase test Success.\n");

  /* 3. Write all the flash and check result */

  ferr("Flash page write/read test start:\n");
  tlsr82_flash_print("Write buffer data:", flash_buffer,
                 TLSR82_PAGE_SIZE);
  for (i = 0; i < npages; i++)
    {
      FLASH_WRITE_TRACE_START();
      ret = tlsr82_flash_bwrite(&priv->mtd, i, 1, flash_buffer);
      FLASH_WRITE_TRACE_END();
      if (ret != 1)
        {
          ferr("    Flash block write failed, ret=%d\n", ret);
          goto errout;
        }
    }

  for (i = 0; i < npages; i++)
    {
      memset(flash_read_buffer, 0, TLSR82_PAGE_SIZE);
      ret = tlsr82_flash_bread(&priv->mtd, i, 1, flash_read_buffer);
      if (ret != 1)
        {
          ferr("    Flash block read failed, ret=%d\n", ret);
          goto errout;
        }

      if (memcmp(flash_read_buffer, flash_buffer, TLSR82_PAGE_SIZE) != 0)
        {
          ferr("    Flash write compare is not equal, page_i=%d\n", i);
          tlsr82_flash_print("Write buffer data:", flash_buffer,
                             TLSR82_PAGE_SIZE);
          tlsr82_flash_print("Read buffer data:", flash_read_buffer,
                             TLSR82_PAGE_SIZE);
          goto errout;
        }
    }

  ferr("Flash page write/read test Success.\n");

