apache/nuttx/arch/arm/src/tlsr82/tlsr82_flash_mtd.c
#ifdef CONFIG_MTD_BYTE_WRITE

  /* 4. Erase chip again for byte write/read test */

  uint32_t offset = 0;
  int k;

  ferr("Erase chip for byte write test\n");
  ret = tlsr82_flash_ioctl(&priv->mtd, MTDIOC_BULKERASE, 0);
  if (ret != OK)
    {
      ferr("    Flash erase failed, ret=%d\n", ret);
      goto errout;
    }

  ferr("Erase chip finished\n");

  ferr("Flash byte read/write test start\n");
  do
    {
      /* i = the write number, j = the flash_buffer index */

      i = 40;
      if (i + offset > priv->size)
        {
          i = priv->size - offset;
        }

      j = offset & 128;

      FLASH_WRITE_TRACE_START();
      ret = tlsr82_flash_write(&priv->mtd, offset, i, &flash_buffer[j]);
      FLASH_WRITE_TRACE_END();

      if (ret != i)
        {
          ferr("    Flash byte write failed, offset: 0x%08lx, ret=%d\n",
               offset, ret);
          goto errout;
        }

      memset(flash_read_buffer, 0, i);

      FLASH_READ_TRACE_START();
      ret = tlsr82_flash_read(&priv->mtd, offset, i, flash_read_buffer);
      FLASH_READ_TRACE_END();

      if (ret != i)
        {
          ferr("    Flash byte read failed, offset: 0x%08lx, ret=%d\n",
               offset, ret);
          goto errout;
        }

      for (k = 0; k < i; k++)
        {
          if (flash_buffer[j + k] != flash_read_buffer[k])
            {
              ferr("    Flash byte write/read compare failed\n");
              ferr("    Flash address: 0x%08lx\n", priv->baseaddr + offset);
              tlsr82_flash_print("Write Data:", &flash_buffer[j], i);
              tlsr82_flash_print("Read Data:", flash_read_buffer, i);
              goto errout;
            }
        }

      offset += i;
    }
  while (offset < priv->size);

  ferr("Flash byte read/write test Success\n");

#endif

#ifdef CONFIG_TLSR82_FLASH_PROTECT
  /* 5. Flash protect/unprotect test:
   *    1) erase the chip;
   *    2) write data into chip;
   *    3) protect flash;
   *    4) erase the chip with flash protected;
   *    5) read the chip, the data should be same as the data written in 2);
   */

  uint8_t status;
  uint32_t addr;

  /* 1) erase the chip */

  ferr("Erase chip for protect/unprotect test\n");
  ret = tlsr82_flash_ioctl(&priv->mtd, MTDIOC_BULKERASE, 0);
  if (ret != OK)
    {
      ferr("    Flash erase failed, ret=%d\n", ret);
      goto errout;
    }

  ferr("Erase chip finished\n");

  /* 2) write data into chip */

  tlsr82_flash_print("Write buffer data:", flash_buffer, TLSR82_PAGE_SIZE);
  for (i = 0; i < npages; i++)
    {
      ret = tlsr82_flash_bwrite(&priv->mtd, i, 1, flash_buffer);
      if (ret != 1)
        {
          ferr("    Flash block write failed, ret=%d\n", ret);
          goto errout;
        }
    }

  /* 3) protect the flash, read the flash status register */

  FLASH_PROT_TRACE_START();
  ret = tlsr82_flash_ioctl(&priv->mtd, MTDIOC_PROTECT, 0);
  if (ret != OK)
    {
      ferr("    Flash protect failed, ret=%d\n", ret);
      goto errout;
    }

  FLASH_PROT_TRACE_END();

  status = tlsr82_flash_read_status(5);
  ferr("Current flash status: 0x%x\n", status);

  /* 4) erase the chip with flash protected */

  addr = priv->baseaddr;
  for (i = 0; i < priv->nsectors; i++)
    {
      tlsr82_flash_erase_sector(addr);
      addr += priv->sectorsize;
    }

  FLASH_UNPROT_TRACE_START();
  ret = tlsr82_flash_ioctl(&priv->mtd, MTDIOC_UNPROTECT, 0);
  if (ret != OK)
    {
      ferr("    Flash unprotect failed, ret=%d\n", ret);
      goto errout;
    }

  FLASH_UNPROT_TRACE_END();

  /* 5) read the chip, the data should be same as the data written in 2) */

  for (i = 0; i < npages; i++)
    {
      memset(flash_read_buffer, 0, TLSR82_PAGE_SIZE);
      ret = tlsr82_flash_bread(&priv->mtd, i, 1, flash_read_buffer);
      if (ret != 1)
        {
          ferr("    Flash block read failed, ret=%d\n", ret);
          goto errout;
        }

      if (memcmp(flash_read_buffer, flash_buffer, TLSR82_PAGE_SIZE) != 0)
        {
          ferr("    Flash write compare is not equal, page_i=%d\n", i);
          tlsr82_flash_print("Write buffer data:", flash_buffer,
                             TLSR82_PAGE_SIZE);
          tlsr82_flash_print("Read buffer data:", flash_read_buffer,
                             TLSR82_PAGE_SIZE);
          goto errout;
        }
    }
#endif

  ferr("======== Flash test Success ========\n");

  return OK;

errout:
  ferr("Flash test Failed.\n");
  return ret;
}
#endif

/****************************************************************************
 * Name: tlsr82_flash_erase
 ****************************************************************************/

static int tlsr82_flash_erase(struct mtd_dev_s *dev, off_t startblock,
                              size_t nblocks)
{
  struct tlsr82_flash_dev_s *priv = (struct tlsr82_flash_dev_s *)dev;
  size_t i;
  uint32_t addr;

  finfo("startblock: %08lx nblocks: %d\n", (long)startblock, (int)nblocks);

  addr = priv->baseaddr + startblock * priv->sectorsize;
  for (i = 0; i < nblocks; i++)
    {
      tlsr82_flash_erase_sector(addr);
      addr += priv->sectorsize;
    }

  return (int)nblocks;
}

/****************************************************************************
 * Name: tlsr82_flash_bread
 ****************************************************************************/

static ssize_t tlsr82_flash_bread(struct mtd_dev_s *dev, off_t startblock,
                                  size_t nblocks, uint8_t *buffer)
{
  struct tlsr82_flash_dev_s *priv = (struct tlsr82_flash_dev_s *)dev;
  uint32_t addr;
  size_t i;

  finfo("startblock: %08lx nblocks: %d\n", (long)startblock, (int)nblocks);

  addr = priv->baseaddr + startblock * priv->pagesize;

  for (i = 0; i < nblocks; i++)
    {
      tlsr82_flash_read_data(addr, buffer, priv->pagesize);
      addr   += priv->pagesize;
      buffer += priv->pagesize;
    }

  return nblocks;
}

/****************************************************************************
 * Name: tlsr82_flash_bwrite
 ****************************************************************************/

