apache/nuttx/arch/arm/src/tlsr82/tlsr82_flash_mtd.c
static ssize_t tlsr82_flash_bwrite(struct mtd_dev_s *dev, off_t startblock,
                                   size_t nblocks, const uint8_t *buffer)
{
  struct tlsr82_flash_dev_s *priv = (struct tlsr82_flash_dev_s *)dev;
  uint32_t addr;
  size_t i;

  finfo("startblock: %08lx nblocks: %d\n", (long)startblock, (int)nblocks);

  addr = priv->baseaddr + startblock * priv->pagesize;

  for (i = 0; i < nblocks; i++)
    {
      tlsr82_flash_write_data(addr, buffer, priv->pagesize);
      addr   += priv->pagesize;
      buffer += priv->pagesize;
    }

  return nblocks;
}

/****************************************************************************
 * Name: tlsr82_flash_read
 ****************************************************************************/

static ssize_t tlsr82_flash_read(struct mtd_dev_s *dev, off_t offset,
                                 size_t nbytes, uint8_t *buffer)
{
  struct tlsr82_flash_dev_s *priv = (struct tlsr82_flash_dev_s *)dev;
  uint32_t addr;

  finfo("offset: %08lx nbytes: %d\n", (long)offset, (int)nbytes);

  addr = priv->baseaddr + offset;

  tlsr82_flash_read_data(addr, buffer, nbytes);

  finfo("return nbytes: %d\n", (int)nbytes);
  return (ssize_t)nbytes;
}

/****************************************************************************
 * Name: tlsr82_flash_write
 ****************************************************************************/

#ifdef CONFIG_MTD_BYTE_WRITE
static ssize_t tlsr82_flash_write (struct mtd_dev_s *dev, off_t offset,
                                   size_t nbytes, const uint8_t *buffer)
{
  struct tlsr82_flash_dev_s *priv = (struct tlsr82_flash_dev_s *)dev;
  uint32_t addr;
  size_t allow_len = 0;
  size_t write_len = 0;
  size_t len = nbytes;

  finfo("offset: %08lx nbytes: %d\n", (long)offset, (int)nbytes);

  addr      = priv->baseaddr + offset;

  do
    {
      /* The allow length is the max allow write length that not cross page */

      allow_len = TLSR82_PAGE_SIZE - (addr & (TLSR82_PAGE_SIZE - 1));
      write_len = MIN(nbytes, allow_len);

#ifdef CONFIG_TLSR82_FLASH_WRITE_BUFFER

      /* The write length can not be larger than FLASH_WRITE_BUF_SIZE */

      write_len = MIN(FLASH_WRITE_BUF_SIZE, write_len);

      /* Copy the data to the buffer and write, the temporary buffer is used
       * to make sure the argument buffer is not in flash. Telink flash is
       * not allowed read during flash writing.
       */

      memcpy(flash_write_buffer, buffer, write_len);
      tlsr82_flash_write_data(addr, flash_write_buffer, write_len);
#else
      tlsr82_flash_write_data(addr, buffer, write_len);
#endif

      addr   += write_len;
      buffer += write_len;
      nbytes -= write_len;
    }
  while (nbytes > 0);

  return (ssize_t)len;
}
#endif

/****************************************************************************
 * Name: tlsr82_flash_ioctl
 ****************************************************************************/

static int tlsr82_flash_ioctl(struct mtd_dev_s *dev, int cmd,
                              unsigned long arg)
{
  struct tlsr82_flash_dev_s *priv = (struct tlsr82_flash_dev_s *)dev;
  int ret = OK; /* Assume good command with good parameters */

  finfo("cmd: %d\n", cmd);

  switch (cmd)
    {
      case MTDIOC_GEOMETRY:
        {
          struct mtd_geometry_s *geo =
              (struct mtd_geometry_s *)((uintptr_t)arg);

          if (geo)
            {
              memset(geo, 0, sizeof(*geo));

              /* Populate the geometry structure with information need to
               * know the capacity and how to access the device.
               *
               * NOTE:
               * that the device is treated as though it where just an array
               * of fixed size blocks.  That is most likely not true, but
               * the client will expect the device logic to do whatever is
               * necessary to make it appear so.
               */

              geo->blocksize    = TLSR82_PAGE_SIZE;
              geo->erasesize    = TLSR82_SECTOR_SIZE;
              geo->neraseblocks = priv->nsectors;
              ret               = OK;

              finfo("blocksize: %" PRId32 " erasesize: %" PRId32
                    " neraseblocks: %" PRId32 "\n",
              geo->blocksize, geo->erasesize, geo->neraseblocks);
            }
          else
            {
              ret = -EINVAL;
            }
        }
        break;

      case MTDIOC_BULKERASE:
        {
          tlsr82_flash_chip_erase(priv);
        }
        break;

      case MTDIOC_PROTECT:
        {
          /* Ignore arg, direct protect full chip */

          tlsr82_flash_protect();
        }
        break;

      case MTDIOC_UNPROTECT:
        {
          /* Ignore arg, direct unprotect full chip */

          tlsr82_flash_unprotect();
        }
        break;

      default:
          ret = -ENOTTY; /* Bad/unsupported command */
          break;
    }

  finfo("return %d\n", ret);
  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tlsr82_flash_initialize
 *
 * Description:
 *   Create an initialize MTD device instance for the internal FLASH.
 *
 *   MTD devices are not registered in the file system, but are created as
 *   instances that can be bound to other functions (such as a block or
 *   character driver front end).
 *
 * Parameter:
 *   offset - offset from 0 of internal flash
 *   size   - available size for NVM
 *
 ****************************************************************************/

struct mtd_dev_s *tlsr82_flash_initialize(uint32_t offset, uint32_t size)
{
  int ret;
  struct tlsr82_flash_dev_s *priv;

  /* If the mtd device address exceeded the flash address space, return
   * NULL.
   */

  if ((offset + size) > (CONFIG_TLSR82_FLASH_SIZE_KB * 1024))
    {
      goto errout;
    }

  /* Allocate a state structure (we allocate the structure instead of using
   * a fixed, static allocation so that we can handle multiple FLASH devices.
   * The current implementation would handle only one FLASH part per QuadSPI
   * device (only because of the QSPIDEV_FLASH(0) definition) and so would
   * have to be extended to handle multiple FLASH parts on the same QuadSPI
   * bus.
   */

  priv = (struct tlsr82_flash_dev_s *)
          kmm_zalloc(sizeof(struct tlsr82_flash_dev_s));
  if (priv)
    {
      /* Initialize the allocated structure (unsupported methods were
       * nullified by kmm_zalloc).
       */

      priv->mtd.erase  = tlsr82_flash_erase;
      priv->mtd.bread  = tlsr82_flash_bread;
      priv->mtd.bwrite = tlsr82_flash_bwrite;
      priv->mtd.read   = tlsr82_flash_read;
#ifdef CONFIG_MTD_BYTE_WRITE
      priv->mtd.write  = tlsr82_flash_write;
#endif
      priv->mtd.ioctl  = tlsr82_flash_ioctl;
      priv->mtd.name   = "tlsr82_flash_mtd";

      priv->baseaddr    = offset;
      priv->size        = size;
      priv->sectorsize  = TLSR82_SECTOR_SIZE;
      priv->pagesize    = TLSR82_PAGE_SIZE;
      priv->nsectors    = size >> TLSR82_SECTOR_SHIFT;

