apache/nuttx/arch/arm/src/tlsr82/tlsr82_flash_mtd.c
      /* Identify the FLASH chip */

      ret = tlsr82_flash_miduid_check(&g_flash_mid, &g_flash_uid[0]);
      if (ret < 0)
        {
          ferr("Flash mid or uid error\n");
          goto errout_with_priv;
        }
    }
  else
    {
      ferr("Flash device malloc failed, size=%lu\n",
           sizeof(struct tlsr82_flash_dev_s));
      goto errout;
    }

  /* Calibrate the flash */

  tlsr82_flash_calibrate(g_flash_mid);

#ifdef CONFIG_TLSR82_FLASH_TEST
  ret = tlsr82_flash_test(priv);
  if (ret < 0)
    {
      ferr("Flash test failed, ret=%d\n", ret);
      goto errout_with_priv;
    }
#endif

  /* Return the implementation-specific state structure as the MTD device */

  finfo("Return %p\n", priv);
  return (struct mtd_dev_s *)priv;

errout_with_priv:
  kmm_free(priv);
  return NULL;

errout:
  return NULL;
}

/****************************************************************************
 * Name: tlsr82_partition_init
 *
 * Description:
 *   Register partition MTD device on the parent MTD device.
 *
 * Parameter:
 *   path - the parent mtd device path.
 *
 ****************************************************************************/

#ifdef CONFIG_MTD_PARTITION
int tlsr82_partition_init(const char *path)
{
  int ret = OK;
  int num;
  int i;

  num = sizeof(tlsr82_part_table) / sizeof(struct tlsr82_partition_s);

  for (i = 0; i < num; i++)
    {
      ret = register_mtdpartition(tlsr82_part_table[i].path, 0, path,
                                  tlsr82_part_table[i].firstblock,
                                  tlsr82_part_table[i].nblocks);
      if (ret < 0)
        {
          ferr("Register mtd partition failed, path=%s, ret=%d\n",
               tlsr82_part_table[i].path, ret);
          break;
        }
    }

  return ret;
}
#endif
